run/flowthermal/HydroCyclone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottomoutlet
    {
        type            patch;
        nFaces          1920;
        startFace       1887676;
    }
    inlet
    {
        type            patch;
        nFaces          876;
        startFace       1889596;
    }
    topoutlet
    {
        type            patch;
        nFaces          1536;
        startFace       1890472;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          38236;
        startFace       1892008;
    }
)

// ************************************************************************* //
