run/flowthermal/HydroCyclone/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

concentration  0;

kBouyancySource
{
    type            coded;
    active          yes;
    select          all;
    //selectionMode   cellZone;
    //cellZone        allZone;
    //name            kBuoyancySource;
    g               (0 -9.81 0);
    ScT             0.7;

    //codedSourceCoeffs
    //{
       // selectionMode   all;

        field          k;

        codeInclude
        #{
             #include "fvm.H"
        #};

        codeCorrect
        #{

        #};

        codeAddSup
        #{
             // Get the input data
             dimensionedVector g
             (
                 dimensionedVector(
                     "g",
                     dimAcceleration,
		     coeffs().lookup("g")
                 )
             ); 
             scalar ScT(readScalar(coeffs().lookup("ScT")));

             // Get the required fields
             const volScalarField& density = mesh().lookupObject<volScalarField>("rho");
             const volScalarField& nut = mesh().lookupObject<volScalarField>("nut");

	     // Get cell volume
	     const scalarField& V = mesh().V();
		
             // Compute the source term
             const scalarField Gb = nut.internalField()/ScT*(g & fvc::grad(density))*V;

             // Add the source term to the equation
             scalarField& kSource = eqn.source();
             kSource += Gb;
        #};

        codeSetValue
        #{
        
        #};

        // Dummy entry. Make dependent on above to trigger recompilation
        code
        #{
            $codeInclude
            $codeCorrect
            $codeAddSup
            $codeSetValue
        #};
    //}
}

epsilonBouyancySource
{
    type            coded;
    active          yes;
    select          all;

    //name            epsilonBuoyancySource;
    g               (0 -9.81 0);
    ScT             0.7;

    //scalarCodedSourceCoeffs
    //{
       // selectionMode   all;

        field          epsilon;

        codeInclude
        #{
             #include "fvm.H"
        #};

        codeCorrect
        #{

        #};

        codeAddSup
        #{
             // Get the input data
             dimensionedVector g
             (
                 dimensionedVector(
                     "g",
                     dimAcceleration,
		     coeffs().lookup("g")
                 )
             ); 
             scalar ScT(readScalar(coeffs().lookup("ScT")));
	     scalar C1 = 0.4;
	     scalar C3 = 0.9;
	     dimensionedScalar k_small("k_small", dimEnergy/dimMass, SMALL);

             // Get the required fields
             const volScalarField& density = mesh().lookupObject<volScalarField>("rho");
             const volScalarField& nut = mesh().lookupObject<volScalarField>("nut");
             const volScalarField& k = mesh().lookupObject<volScalarField>("k");
             const volScalarField& epsilon = mesh().lookupObject<volScalarField>("epsilon");

             // Compute the buoyancy term
             const volScalarField Gb = nut/ScT*(g & fvc::grad(density));

             // Add the source term to the equation
             scalarField& epsilonSource = eqn.source();
             epsilonSource -= C1*epsilon/(k + k_small)*C3*Gb;
        #};

        codeSetValue
        #{
        
        #};

        // Dummy entry. Make dependent on above to trigger recompilation
        code
        #{
            $codeInclude
            $codeCorrect
            $codeAddSup
            $codeSetValue
        #};
    //}
}
/*
inletConcentration
{
    type            scalarFixedValueConstraint;
    active          yes;

    selectionMode   cellZone;
    cellZone        inletZone;
    fieldValues
    {
        C	        $concentration;
        k	        3.9e-11; 
        epsilon	    4.4e-17;
    }
}

transitionValues0
{
    type            scalarFixedValueConstraint;
    active          yes;

    selectionMode   cellZone;
    cellZone        transitionZone0;
    fieldValues
    {
        k           3.9e-11;
        epsilon     4.4e-17;
    }
}
transitionValues1
{
    type            scalarFixedValueConstraint;
    active          yes;

    selectionMode   cellZone;
    cellZone        transitionZone1;
    fieldValues
    {
        k           3.88e-4;
        epsilon     6.87e-7;
    }
    */
}

// ************************************************************************* //
